{
  "date": "2021-02-23T15:33:18.136Z",
  "title": "What are the goals of psychology?",
  "body": "What are the goals of psychology? As a science, we need to describe the object of study and to explain it. So what is the object of study? We could want to describe and explain *experience*--thoughts, feelings, sensations, and in general \"mental life\". We could want to describe and explain *behaviour*--what organisms (or psychological beings) *do*. We could also want to describe and explain the brain, which is generally accepted to be the *organ* of thought and of behaviour.\n\n\nLet's be ecumenical and adopt all of these goals, as these are all important aspects of psychological beings. They are also (not entirely uncontroversially) importantly interrelated. While we seem fairly capable of describing mind, brain, and behaviour in their own terms, we can't ultimately *explain* how thought works without explaining how the brain works, and we can't *ultimately* explain behaviour without understanding how thought works (this is a substantial thesis and it is denied by *epiphenomenalists*, but it is one I will adopt), and we can't understand how the brain *works* if we don't understand what it *does*, which in large part consists in regulating behaviour.\n\n\nIf we accept the above, here's a list of questions we're left with, and broad names we could give to their study:\n\n1. Descriptive questions: \n\n   1. What is thought like? (Phenomenology)\n   2. What is behaviour like? (Ethology)\n   3. What is the brain like? (Neuroscience)\n\n2. Explanatory questions:\n\n   1. How does it all work?\n\nConspicuously, the explanatory questions have all collapsed into one. While I suspect very few would deny that these three facets of psychology are interrelated, trying to imagine actual human beings investigating all of these aspects at once would be A) daunting in its demand for requisite background and training, and B) a radical departure from the way that academic work is divided amongst specialists trained in disciplines and subdisciplines. This is a very 21st-century problem--so very much data, but so little meaningful integration. It's hard to know how to go about that project--do we try to get specialists to coordinate? Do we try to foster generalists? Do we need to make space for large, interdisciplinary teams to work on projects together? Do we try to leverage machine-learning techniques that can transform seas of data into human-interpretable generalizations? I can't answer this, But nonetheless, we should all hope that it's only a matter of time before solutions are discovered for this puzzle. When we do, I hope I get to be a part of it.",
  "tags": "Psychology",
  "description": "tl;dr: I propose: describing and mind, brain, and behaviour, and giving a unified explanation of them."
}